<?php 


## 贪婪匹配

preg_match_all('/\d+/', 'aaaaa123到底46', $matches);
print_r($matches);

Array
(
    [0] => Array
        (
            [0] => 123
            [1] => 46
        )

)



/*********************************************************************/

## 非贪婪匹配

preg_match_all('/\d+/U', 'aaaaa123到底46', $matches);
print_r($matches);


Array
(
    [0] => Array
        (
            [0] => 1
            [1] => 2
            [2] => 3
            [3] => 4
            [4] => 6
        )

)

/*********************************************************************/

preg_match_all('/(\d)+/U', 'aaaaa123到底46', $matches);
print_r($matches);


Array
(
    [0] => Array
        (
            [0] => 1
            [1] => 2
            [2] => 3
            [3] => 4
            [4] => 6
        )

    [1] => Array
        (
            [0] => 1
            [1] => 2
            [2] => 3
            [3] => 4
            [4] => 6
        )

)
?>